Repository: osvamsoftware/portafolio_marin
Catalog: lib/l10n/app_*.arb
Languages: es

source: ABOUT ME
es: SOBRE MÍ

# helloIm
source: Hello, Im Osva
es: Hola, soy Osva

# myDescription
source: Im passionate about cross-platform developtment, but especially about frontend and backend mobile developtment. When im not programig, im doing sports activities or having coffee with friends, i love work with teams!
es: Soy apasionado por el desarrollo multiplataforma, especialmente en el desarrollo móvil de frontend y backend. Cuando no estoy programando, practico actividades deportivas o tomo café con amigos. ¡Me encanta trabajar en equipo!

# mySkills
source: My Skill
es: Mis Habilidades

source: Services
es: Servicios

source: Projects
es: Proyectos

source: What I Do?
es: ¿Qué Hago?

source: Contact
es: Contacto

source: Name
es: Nombre

source: Message
es: Mensaje

source: Send
es: Enviar

# sending
source: Sending message
es: Enviando mensaje

# sended
source: The message sended done
es: El mensaje se ha enviado

# thanksFor
source: Thank you for contacting me, I will contact you shortly to continue with the process.
es: Gracias por contactarme, en breve me pondré en contacto contigo para continuar con el proceso

# error
source: Something went wrong
es: Parece que algo salió mal

# tryAgain
source: Please try again later or contact me in my social channels
es: Por favor, intenta más tarde, o contactame por mis redes sociales.

# areYouReady
source: Are you ready to work with me? Send me a message in my social channels
es: ¿Estás listo para que trabajemos juntos?, Envíame un mensaje y hagamos equipo llevando los proyectos a otro nivel.

# eCommerceDescription
source: App with login and register sesion with email, password, Facebook and Gmail. Contains a store home and stock, user and Admin Mobile Sections, with custom Widgets, Go navigation, some animations. Custom Painter to notifications Items. Using Clean Arch and Riverpod(or BLoC) like State Managenment.
es: Aplicación con sesión de inicio y registro con correo electrónico, contraseña, Facebook y Gmail. Contiene una página de inicio y stock de la tienda, secciones móviles de usuario y administrador, con widgets personalizados, navegación con Go, algunas animaciones. Usando Clean Arch y Riverpod (o BLoC) como gestor de estado.

# eventDescription
source: Mobile application to schedule events in a social space. The application allows users to set dates to use properties. Flutter and Dart were used, BLoC as a state manager, also use of Date Picker and packages related to calendars. Local storage.
es: Aplicación móvil para programar eventos en un espacio social. La aplicación permite a los usuarios establecer fechas para utilizar propiedades. Se utilizaron Flutter y Dart, BLoC como gestor de estado, también se utiliza Date Picker y paquetes relacionados con calendarios. Almacenamiento local.

# travelDescription
source: Mobile application in which the record of trips in heavy load trucks is kept, the moment in which it arrives at the destination, inconveniences along the way, expenses, documentation, duration of the trip and more. BLoC as a state manager, Firebase and Py Fast Api for CRUD.
es: Aplicación móvil en la que se registra el viaje en camiones de carga pesada, el momento en que llega al destino, inconvenientes en el camino, gastos, documentación, duración del viaje y más. BLoC como gestor de estado, Firebase y Py Fast Api para CRUD.

# taxiDescription
source: App to manage vehicles that provide private taxi transportation service. BLoC was used as a state manager, Firebase and NodeJs for backend and realtime, Google Maps, Polylines, Firebase Auth. User App, Driver App and Administrator App.
es: Aplicación para gestionar vehículos que brindan servicio de transporte privado en taxi. Se utilizó BLoC como gestor de estado, Firebase y NodeJs para el backend y tiempo real, Google Maps, Polylines, Firebase Auth. Aplicación de usuario, aplicación de conductor y aplicación de administrador.
